## Plan Result (Aks_ptlsbox - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      ~ id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ max_count                     = 10 -> 4
      ~ min_count                     = 3 -> 2
        name                          = "linux"
      ~ node_count                    = 3 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ vm_size                       = "Standard_D8ds_v5" -> "Standard_DS3_v2" # forces replacement
      - zones                         = [] -> null
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":678,"Program":"tfcmt","SHA1":"","Target":"Aks_ptlsbox - DeployInfrastructure","Vars":{}} -->